In [ ]:
### 1. 상대경로 / 절대경로
### 2. 데이터불러오기 (pandas ~ csv ~ sep 활용법 기억)
### 3. 데이터 불러올 경우 한글 유의

## 1. 라이브러리 정의

In [19]:
import pandas as pd

## 2. 데이터 불러오기

In [43]:
data = pd.read_csv("../dataset/kopo_region_mst_hangul.csv", encoding='ms949') #encoding ='ms949 or utf-8' 한글일때

## 3. 데이터 변환(컬럼이름 변경)

In [46]:
# data 컬럼 재정의 1
data.columns = ["regionid","productgroup","yearweek","volume"]

In [52]:
# data 컬럼 재정의 2
# 변수지정을 해줘야 바꾼 컬럼명으로 볼 수 있다 (rename한다고 영구적으로 바뀌는것 X)
renamedData = data.rename(columns={"SALESID":"SID", "REGIONNAME":"SNAME"})

In [53]:
renamedData

    SID  SNAME
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

## 4. 데이터 저장(Unload)

In [57]:
#저장하는 코드
data.to_csv("./hangul.csv",
           encoding='ms949',
           index=False)

## 4-1. 데이터 저장(postgres에저장)

In [7]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [8]:
data = pd.read_csv("../dataset/kopo_region_mst_hangul.csv", encoding='ms949')

In [48]:
mylocalpgUrl = "postgresql://postgres:postgres@127.0.0.1/postgres"

In [49]:
engine_pg = create_engine(mylocalpgUrl)

In [50]:
resultTableName = "pg_out"

In [51]:
data.to_sql(name=resultTableName,
           con=mylocalpgUrl, if_exists="replace", index=False)

In [53]:
pd.read_sql(sql="select * from pg_out", con=engine_pg)

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71       None
72      A99         기타

[73 rows x 2 columns]

## 파일 데이터 불러오기

In [5]:
# 깃허브에서 불러오는 법
a = "https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv"

In [6]:
pd.read_csv(a)

     age  gender  miles   debt  income  sales
0     28       0     23      0    4099    620
1     26       0     27      0    2677   1792
2     30       1     58  41576    6215  27754
3     26       1     25  43172    7626  28256
4     20       1     17   6979    8071   4438
..   ...     ...    ...    ...     ...    ...
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

[963 rows x 6 columns]

In [32]:
#엑셀파일 불러오는 법
pd.read_excel("../../../SMART-23/Desktop/titanic.xlsx")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [59]:
#엑셀파일 csv파일로 변경한 후 불러오는 법
pd.read_csv("./aa.csv",sep="\t")

FileNotFoundError: [Errno 2] No such file or directory: './aa.csv'

In [39]:
indata = pd.read_csv("./curData.csv")

In [58]:
indata.to_csv("./outData.csv", index=False) #False 는 index 없게 저장, true 는 index 있게 저장

## (과제)다른 컴퓨터에서 데이터 가져오기

In [9]:
import pandas as pd

In [10]:
import psycopg2
from sqlalchemy import create_engine

In [11]:
mylocalpgUrl = "postgresql://postgres:postgres@192.168.110.9:5432/postgres"

In [12]:
engine_pg = create_engine(mylocalpgUrl)

In [13]:
resultTableName = "jam_out"

In [14]:
data = pd.read_csv("../../../SMART-23/Desktop/a.txt")

In [15]:
data.to_sql(name=resultTableName,
           con=mylocalpgUrl, if_exists="replace", index=False)

In [16]:
pd.read_sql(sql="select * from jam_out", con=engine_pg)

  아이언맨   헐크   토르
0  김재민  최성운  이경률
1   치킨   피자   족발